
{
  "title":"Readings",
  "content":"Most of the readings are assigned from the required textbook Bona, Miklos. A Walk Through Combinatorics: An Introduction to Enumeration and Graph Theory. World Scientific Publishing Company, 2011. ISBN: 9789814335232. [Preview with Google Books]\nSES # TOPICS READINGS 1 Pigeonhole Principle Chapter 1 2 Induction, Elementary Counting Chapter 2 and start Chapter 3. 3 Elementary Counting (concluded) Chapter 3 (continued) 4 Binomial Theorem, Compositions Chapter 4 5 Compositions (concluded), Integer Partitions Chapter 5\n6 Integer Partitions (concluded) 7 Set Partitions 8 Permutations, Cycle Type Chapter 6\n9 Permutations (cont.), Stirling Numbers of the First Kind 10 Permutations (concluded) 11 The Sieve Chapter 7\n12 The Sieve (cont.), Generating Functions 13 Generating Functions (continued) Chapter 8\n14 Generating Functions (concluded) 15 Catalan Numbers 16 Midterm One-Hour Exam 1 (Chapters 1–7, omitting pp. 123–24) 17 Partitions Chapter 8 (continued)\n18 Exponential Generating Functions 19 Exponential Generating Functions (concluded) 20 Vertex Degree, Eulerian Walks Chapter 9\n21 Isomorphism, Hamiltonian Cycles 22 Tournaments, Trees Chapter 10\n23 Counting Trees 24 Minimum Weight Spanning Trees Matrix-Tree Theorem (PDF)\nparalleling Section 10.4. There are\nalso two exercises.\nMore on Matrix-Tree Theorem (PDF)\nfor information only to see some\nmore algebraic combinatorics.\n25 Matrix-Tree Theorem Chapter 10 (continued) 26 Matrix-Tree Theorem (concluded), Bipartite Graphs Finish Chapter 10 and start Chapter 11. 27 Bipartite Graphs (concluded) Chapter 11 28 Matchings in Bipartite Graphs Chapter 11 (continued) 29 Midterm One-Hour Exam 2 (Chapters 8–10.2) 30 Latin Rectangles, Konig-Egervary Theorem Chapter 11 (continued)\n31 Matchings in Bipartite Graphs (concluded) 32 Chromatic Polynomials 33 Planar Graphs Chapter 12\n34 Polyhedra 35 Polyhedra (concluded) 36 Coloring Maps 37 Ramsey Theory Chapter 13\n38 A Probabilistic Proof 39 Discussion of Final Exam, Answering Questions 40 Final Exam (Chapters 1–12) "}


