
{
  "title":"Problem Set 12",
  "content":"Most of the problems are assigned from the required textbook Bona, Miklos. A Walk Through Combinatorics: An Introduction to Enumeration and Graph Theory. World Scientific Publishing Company, 2011. ISBN: 9789814335232. [Preview with [Google Books]]\nA problem marked by * is difficult; it is not necessary to solve such a problem to do well in the course.\nProblem Set 12 Due in Session 37 Practice Problems Session 33: Chapter 12: Exercises 1, 3, 4, 10 Session 34: None Session 35: Chapter 12: Exercise 22 Session 36: Chapter 12: Exercises 7, 8, 9 Session 37: Chapter 13: Exercises 4, 6, 7, 8. By \u0026ldquo;the space,\u0026rdquo; the author means three-dimensional Euclidean space. (It is common to say \u0026ldquo;the plane\u0026rdquo; for the Euclidean plane, but I never heard \u0026ldquo;the space\u0026rdquo; before.) Non-practice\u0026quot; problems, but not to be handed in: Chapter 13: Exercises 20, 24, 38 in 24, the phrase \u0026ldquo;five persons on the bus who know at least four of the other passengers\u0026rdquo; means \u0026ldquo;five persons on the bus, each of whom know at least four of the other passengers\u0026rdquo;. The definition of a permutation of an infinite set S in 38 is vague and incorrect. Regard a permutation of the positive integers as a sequence a1, a2, … of positive integers such that every positive integer occurs exactly once. We say that this sequence contains an increasing arithmetic progression of length three if there exist i\u0026lt;j\u0026lt;k such that ai, ak is an increasing arithmetic progression. Problems Assigned in the Textbook Chapter 12: Exercises 13, 18, 19, 20, 21. For 20, note that it is o.k. for pa=0 or pb=0. Additional Problems (A19) Let n≥4. Suppose that P is a convex polyhedron with one n-vertex face and two additional vertices. What is the most number of faces that P can have? (A20) Show that the complete graph K7 can be embedded on a torus without crossing edges. Draw the torus as a square (or rectangle) with opposite edges identified. (A21*) Find a triangle-free graph (i.e., no three vertices that are pairwise adjacent) with chromatic number four. Try to use as few vertices as possible. Bonus Problems (B5) Find three states of the United States with the property that there exist three points in common to all three of them. Note. Suppose we choose a point in the interior of each of the states and join it to the three intersection points. Why does this not give a planar embedding of K3*,*3? "}


