
{
  "title":"Problem Set 6",
  "content":"Most of the problems are assigned from the required textbook Bona, Miklos. A Walk Through Combinatorics: An Introduction to Enumeration and Graph Theory. World Scientific Publishing Company, 2011. ISBN: 9789814335232. [Preview with Google Books]\nA problem marked by * is difficult; it is not necessary to solve such a problem to do well in the course.\nProblem Set 6 Due in Session 17 Practice Problems Session 14: Chapter 8: Exercises 1, 2, 4, 7, 8, 10, 14* Additional practice problem: Let f(n) denote the number of permutations π of 1,2,…,n such that for all 1≤i≤n we have π(i) = i-1, i, i+1, or i+2. (Set f(0)=1.) For instance, f(3)=4, the four permutations being 123, 132, 213, 312. Find the generating function G(x) = Σn≥0 f(n)xn. You do not need to find a formula for f(n). What if we do not allow fixed points, i.e., we exclude π(i)=i? Hint. Consider the digraph of π where we write the vertices 1,2,…,n in a line. Session 15: None from textbook (additional practice problem): Suppose we have 2_n_ points on the circumference of a circle. Show that the number of ways we can draw n noncrossing diagonals connecting the points, such that each of the points is an endpoint of one of the diagonals, is equal to the Catalan number Cn. Give a bijection with ballot sequences of length 2_n_. (Ballot sequences and Catalan numbers were discussed in class.) Problems Assigned in the Textbook Chapter 8: Exercises 24, 26, 35. In 24 use generating functions. Do not simply guess the answer and verify that it is correct. In 35, Hn should be hn. Also find a simple explicit formula for hn. Additional Problems (A7) Let f(n) be the number of ways to stack pennies against a flat wall as follows: the bottom level consists of a row of n pennies, each tangent to its neighbor(s). A penny may be placed in a higher row if it is supported by two pennies below it. Here is an example (PDF) for n=10 and for all five possibilities when n=3. Show that f(n)=Cn, a Catalan number. (One of many methods is to give a bijection with the Dyck paths discussed in class.) Bonus Problems None "}


